nasbarok/desknode/firmware/desknode/sdkconfig.defaults
# DeskNode — configuration de référence du pipeline d'affichage (story dn1-2).
#
# ⚠️ PIÈGE, le plus coûteux du projet : ce fichier n'est lu que pour PRODUIRE
# `sdkconfig`. Si un `sdkconfig` existe déjà (il est gitignoré, donc INVISIBLE à
# `git status`), c'est LUI qui gagne, en silence.
#     Règle du dépôt : toute modification ici se valide par
#         rm sdkconfig && idf.py build
#     puis par la LECTURE du bandeau de boot, pas par la lecture de ce fichier.
#
# Une ligne = une raison. Rien ici n'est un défaut d'ESP-IDF : chaque symbole
# ci-dessous corrige un défaut qui produirait un build « qui compile et qui rame ».

# ── Cible ────────────────────────────────────────────────────────────────────
# Figée en dn1-1 (décision D-B : ESP-IDF v5.5.5, esp32s3 seul).
CONFIG_IDF_TARGET="esp32s3"

# ── Flash ────────────────────────────────────────────────────────────────────
# Défaut IDF = 2MB. La carte en porte 16 : sans cette ligne le bootloader
# annonce 2MB et toute partition au-delà de 0x200000 est inaccessible.
# (Solde l'écart légué par dn1-1.)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Table de partitions maison : 4 MiB d'app + une partition d'assets + une
# partition « stimulus » sacrifiable pour les écritures flash d'AC6.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── PSRAM ────────────────────────────────────────────────────────────────────
# Défaut IDF = n. Sans PSRAM, pas de framebuffer 614 400 o : l'ESP32-S3 n'a que
# ~512 KiB de RAM interne, dont une partie déjà prise.
CONFIG_SPIRAM=y

# Défaut IDF = QUAD. Le module ESP32-S3R8 embarque de la PSRAM OCTALE : en quad
# elle n'est pas détectée du tout (le bandeau de boot le dit).
CONFIG_SPIRAM_MODE_OCT=y

# Défaut IDF = 40M. À 40 MHz la bande passante ne suffit pas au refill DMA de
# l'écran (23,0 Mo/s en continu rien que pour afficher) : l'image scintille.
# ⛔ 120M est INTERDIT ici : le Kconfig d'Espressif prévient qu'un écart de ~20 °C
#    après le boot fait planter les accès PSRAM aléatoirement. DeskNode vit H24
#    sur la façade d'une tour de jeu — l'écart de température est le régime
#    nominal, pas un cas limite. Ce n'est pas une optimisation, c'est une panne
#    programmée. (source : components/esp_psram/esp32s3/Kconfig.spiram)
CONFIG_SPIRAM_SPEED_80M=y

# ── Écran RGB ────────────────────────────────────────────────────────────────
# Défaut IDF = n. Retenu, mais ⚠️ EFFET PROPRE NON MESURÉ : conservé PAR
# PRÉCAUTION, parce que son coût est nul — pas parce qu'un A/B l'a démontré.
# La raison d'origine est RÉFUTÉE : il avait été activé pour que le compteur
# vsync continue de tourner pendant les écritures flash d'AC6. Or le compteur
# est AVEUGLE à ce défaut de toute façon — 37,33 Hz avant le stimulus,
# 37,45 Hz pendant. Il n'y avait rien à y voir.
# La raison de remplacement — « sans lui, le décalage devient partiellement
# irrattrapable » — n'est PAS démontrée non plus : les seules branches mesurées
# avec `ISR_IRAM_SAFE=n` portaient AUSSI un bounce buffer de 19 200 px, donc
# DEUX variables changées à la fois, ce qu'AC6 interdit explicitement (« une
# seule variable à la fois »). La branche « bounce 0, ISR_IRAM_SAFE=n » n'a
# jamais été jouée, ni ici ni ailleurs dans le dépôt.
# Décision owner : on ne re-mesure pas, on garde le symbole, et on écrit ici que
# son effet propre est INCONNU — plutôt que de laisser une justification fausse.
# Contrainte induite, elle bien réelle : le callback vsync doit être IRAM_ATTR
# et ne toucher que de la RAM interne.
#
# ── dn1-4, 2026-08-16 : LA BRANCHE JAMAIS JOUÉE EST JOUÉE ────────────────────
# Symptôme NOUVEAU, qui rouvre l'arbitrage (§0 l'autorise à cette condition) :
# dès qu'une transaction I2C a lieu PENDANT que la dalle affiche, l'image défile
# à toute vitesse. Constat owner : permanent en lecture tactile `poll` (30
# transactions/s), présent uniquement pendant le contact du doigt en `event`,
# absent au repos. Avant dn1-4 aucune story ne faisait d'I2C en fonctionnement —
# le TCA9554 ne sert qu'au boot — donc personne ne pouvait le voir.
# ⚠️ Ce défaut BLOQUE AUSSI dn2-1 (BME680, BH1750, VL53L0X, INA219 sur ce bus).
#
# Mécanisme, CONFIRMÉ depuis : sur ESP32-S3, la flash et la PSRAM partagent le
# contrôleur SPI0. La DMA du panneau RGB lit le framebuffer PSRAM à 23,0 Mo/s en
# continu ; du code exécuté depuis la flash (le driver I2C) provoque des défauts
# de cache qui lui volent ce bus, et elle est affamée EN COURS DE TRAME. Signature
# qui l'établit : la bande du haut reste stable pendant que le bas défile — un
# décrochage global les emporterait toutes les deux.
#
# ── LES DEUX MESURES DE dn1-4, DANS L'ORDRE OÙ ELLES ONT ÉTÉ FAITES ─────────
#
# 1. EFFET PROPRE DE CE SYMBOLE, enfin mesuré (le trou que ce bloc signalait) :
#    branche « bounce 0, ISR_IRAM_SAFE=n », tactile en `poll`.
#    => AUCUN EFFET sur le défilement. Il défile exactement pareil. Ce symbole
#       n'est donc PAS une parade à la famine de la DMA, et ce point est
#       désormais mesuré au lieu d'être inconnu.
#
# 2. CE QU'IL EMPÊCHAIT, en revanche : le BOUNCE BUFFER. Avec =y, activer le
#    bounce fait paniquer la carte au boot — « Guru Meditation Error: Core 0
#    panic'ed (Cache error). Cache disabled but cached memory region accessed » —
#    parce qu'une ISR IRAM-safe ne peut pas recopier depuis un framebuffer PSRAM,
#    qui est de la mémoire cachée. Avec =n, le bounce démarre et TIENT.
#    C'est très probablement l'explication du « watchdog » qui avait disqualifié
#    le bounce en dn1-2 : les deux options étaient nouées, et jamais démêlées.
#
# ⇒ On garde =n NON PAS pour son effet propre (nul), mais parce qu'il est la
#   CONDITION du bounce buffer, qui est lui la parade mesurée (voir
#   DN_DEFAULT_BOUNCE_PX dans dn_bootcfg.c).
# ⚠️ Contrainte induite LEVÉE : le callback vsync n'est plus obligé d'être
#    IRAM_ATTR. Il le reste — ça ne coûte rien et ça ne ment pas.
CONFIG_LCD_RGB_ISR_IRAM_SAFE=n

# Défaut IDF = n. MESURÉ NÉCESSAIRE ICI, le 2026-08-14, sur cette carte.
# SYMPTÔME sans cette ligne : l'image s'affiche avec les BONNES COULEURS mais
# un cadrage décalé EN PERMANENCE — coupée en deux, la partie de droite
# revenant sur la gauche, le carré rouge du coin haut-gauche de la mire se
# retrouvant vers le milieu de la première ligne.
# PREUVE que c'est bien ça : SANS ce symbole, un appel manuel à
# `esp_lcd_rgb_panel_restart()` (commande console `dma`) remet l'image en place
# d'un coup. Le décalage est donc un décrochage de la DMA au démarrage, pas une
# erreur de timings ni de brochage.
# Ce que fait le symbole (Kconfig d'Espressif) : « Reset the GDMA channel every
# VBlank to stop permanent desyncs from happening. Only need to enable it when
# in your application, the DMA can't deliver data as fast as the LCD consumes
# it. » — c'est exactement notre cas : 23,0 Mo/s en continu depuis la PSRAM.
# ⚠️ CONSÉQUENCE, à ne jamais oublier en lisant une observation : ce symbole
#    ACTIVÉ rend la commande `dma` INOPÉRANTE. Dans
#    components/esp_lcd/rgb/esp_lcd_panel_rgb.c:1149-1165,
#    `lcd_rgb_panel_try_restart_transmission()` pose `do_restart = true` sans
#    condition sous `#if CONFIG_LCD_RGB_RESTART_IN_VSYNC`, et ne LIT JAMAIS
#    `panel->flags.need_restart` — le seul bit que `esp_lcd_rgb_panel_restart()`
#    (ligne 464/472) sait poser. Le redémarrage a déjà lieu à chaque VBlank tout
#    seul. Tout « le `dma` a remis l'image » relevé SOUS cette configuration
#    crédite la commande d'un travail qu'elle n'a pas fait.
#
# ═══════════════════════════════════════════════════════════════════════════
# 🔴 BRANCHE D'ESSAI DU 2026-08-23 — LE SYMBOLE PASSE A `n`
#    ⛔ TOUT CE QUI PRECEDE RESTE VRAI ET N'EST PAS EFFACE : c'est le motif de
#       `y`, et il etait juste EN dn1-2. Ce qui a change, c'est le contexte.
# ═══════════════════════════════════════════════════════════════════════════
#
# 🔴 CE QUE L'ENQUETE A ETABLI (investigations/glissement-dma-restart-in-vsync) :
#    LE GLISSEMENT DE TRAME N'EST PAS LA FAMINE, C'EST SON RATTRAPAGE.
#    Espressif l'ecrit au-dessus de `lcd_rgb_panel_try_restart_transmission()`
#    (esp_lcd_panel_rgb.c:1142-1148) :
#      « this fix can lead to SINGLE-FRAME DESYNCS itself : if this interrupt is
#        LATE ENOUGH, the display will SHIFT as the LCD controller already read
#        out the first data bytes, and resetting DMA will RE-SEND those. »
#    A `y`, ce reset est joue INCONDITIONNELLEMENT ~37,4 fois par seconde =>
#    37,4 occasions de glisser par seconde. dn4-10 a mesure 0,79 a 0,94
#    corruption/s sous agent reel, et l'owner voit « quelques pixels vers le bas,
#    ca s'abaisse puis revient, quasiment toutes les secondes ».
#
# 🔴 POURQUOI LES CINQ LEVIERS DE dn4-10 ONT ECHOUE : ils visaient TOUS la
#    famine (`bounce_px` sur 3 crans, `draw_lines`, `ISR_IRAM_SAFE`, `bandes`,
#    `groupe`). AUCUN ne touchait au rattrapage. Ils ne POUVAIENT pas suffire.
#
# 🎯 A `n`, la branche `#else` est tout autre chose (esp_lcd_panel_rgb.c:1153) :
#      - reset SEULEMENT si `need_restart` (recalage demande) OU si
#        `bb_eof_count < expect_eof_count`, c'est-a-dire FAMINE AVEREE ;
#      - et `bb_eof_count` y est enfin REMIS A ZERO. A `y` il ne l'est jamais et
#        le test est compile HORS du binaire : le driver ne SAIT pas s'il y a
#        famine, il reset « au cas ou ».
#    => moins de resets, et chacun justifie.
#
# ⚠️ LE MOTIF DE `y` A DISPARU AVEC `num_fbs = 2`. Il a ete retenu en dn1-2 pour
#    un decrochage au DEMARRAGE, dans un monde a DEUX framebuffers. Depuis le
#    2026-08-15 il n'y en a plus qu'UN, et le dossier ecrit lui-meme « il n'y a
#    plus de bascule, donc plus rien a perdre » (affichage.md:487).
#    Trois faits DEJA AU DEPOT, jamais rapproches :
#      1. affichage.md:599 — a `n`, le decalage au boot se corrige par UN SEUL
#         appel, « remet l'image en place d'un coup ». Pas un blocage.
#      2. affichage.md:541 — `n` + recalage evenementiel a DEJA tourne en dn1-3 :
#         « cadrage CORRECT — le defaut que `y` corrigeait N'EST PAS REVENU »,
#         9 recalages, 1 vsync suffit.
#      3. affichage.md:551 — son seul cout, « l'image reste decalee DEPUIS LA
#         BASCULE », est indexe sur une bascule qui n'existe plus.
#
# ✅ ET LA COMMANDE `dma` REDEVIENT OPERANTE — le paragraphe ci-dessus qui la
#    declare inoperante redevient FAUX a `n`, et c'est voulu : c'est le filet de
#    recuperation si le recalage de boot ratait.
#
# ⚠️ CE QUI RESTE A PROUVER, ET C'EST POURQUOI ON PARLE D'UNE BRANCHE D'ESSAI :
#    `n` n'a JAMAIS ete mesure a `num_fbs = 1`. L'A/B qui l'avait ecarte datait
#    de dn1-2, a deux framebuffers. Si l'image sort decalee en permanence et que
#    le recalage de boot ne la rattrape pas => revenir a `y`, et le dire.
CONFIG_LCD_RGB_RESTART_IN_VSYNC=n

# ── Mesure ───────────────────────────────────────────────────────────────────
# Défaut IDF = 100 Hz, soit un tick de 10 ms — plus grossier que la période
# d'une trame (26,7 ms) et que la cadence de bascule d'AC5. À 1000 Hz, un
# vTaskDelay(1) vaut 1 ms et la cadence du stimulus est pilotable.
CONFIG_FREERTOS_HZ=1000

# Défaut IDF = n. AC6 demande de chiffrer le coût de la configuration retenue en
# « PSRAM consommée, temps de boot, CHARGE CPU ». Les deux premiers sont mesurés
# (§5.4 du fichier `hardware/`), la charge CPU ne l'était NULLE PART dans le
# dépôt. Ce symbole arme `vTaskGetRunTimeStats()`, qu'imprime la commande
# console `cpu`. Il sélectionne tout seul FREERTOS_USE_TRACE_FACILITY et
# FREERTOS_USE_STATS_FORMATTING_FUNCTIONS : rien à ajouter pour eux.
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

