nasbarok/desknode/firmware/desknode/sdkconfig.defaults
# C'est DÉJÀ le défaut du choice, et on l'écrit quand même : l'autre branche
# (CONFIG_FREERTOS_RUN_TIME_STATS_USING_CPU_CLK) compterait des CYCLES et non du
# temps — sa fréquence bouge avec le DFS — et son compteur 32 bits DÉBORDE en
# ~17 s, moins que la fenêtre d'une observation. L'esp_timer tourne à 1 MHz quoi
# qu'il arrive et déborde en ~4 290 s.
# (source : components/freertos/Kconfig, choice FREERTOS_RUN_TIME_STATS_CLK)
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y

# ── XIP depuis la PSRAM — RÉFUTÉ, donc ABSENT ────────────────────────────────
# ⚠️ Ce bloc ne justifie AUCUNE ligne : `CONFIG_SPIRAM_XIP_FROM_PSRAM` est
# DÉLIBÉRÉMENT absent de ce fichier (défaut IDF = n, on le garde à n). Il est
# écrit ici pour qu'on ne le rajoute pas « au cas où » à la prochaine relecture.
#
# SYMPTÔME visé, sous stimulus d'écriture flash (effacement + écriture de
# secteurs de 4 KiB en boucle, ~184 686 o/s soutenus, ~45 secteurs/s) :
# « l'image défile vers la droite EN PERMANENCE ». Ce n'est PAS le
# « scintillement » annoncé par research-paysage.md §4 : c'est un décrochage DMA
# qui se reproduit à chaque secteur et dont le décalage S'ACCUMULE — un défaut
# PERMANENT, pas un papillotement. La description mérite d'être gardée telle
# quelle : c'est elle qui a corrigé la prédiction de la recherche.
#
# VERDICT, mesuré le 2026-08-14 sur cette carte : sous stimulus IDENTIQUE,
# l'image défile EXACTEMENT PAREIL avec XIP et sans XIP. XIP est RÉFUTÉ pour ce
# défaut.
# POURQUOI le mécanisme ne s'applique pas — et la nuance est tout le sujet : la
# PSRAM octale et la flash partagent bien le contrôleur SPI0, mais XIP ne retire
# de la flash que les LECTURES de code et de constantes. Notre stimulus fait des
# ÉCRITURES flash explicites, qui bloquent SPI0 de toute façon, XIP ou pas.
# CE QU'IL AURAIT COÛTÉ pour rien : −342 876 o de PSRAM et +1,6 Ko de binaire.
# ⚠️ Le compteur vsync ne voit RIEN de ce défaut : le contrôleur LCD garde sa
#    cadence même affamé, il sort des pixels périmés. Mesuré : 37,33 Hz avant le
#    stimulus, 37,45 Hz pendant. C'est l'œil qui est l'instrument, pas le fps.
# Il n'existe à ce jour AUCUNE parade logicielle à cette contention : la
# mitigation est architecturale — ne pas écrire en flash pendant l'affichage
# (décision owner D4, pas d'OTA en V1). Détail : §5.3 de
# `hardware/ESP32-S3-Touch-LCD-2.8B-affichage.md`.

# ── Console INTERACTIVE sur l'USB ────────────────────────────────────────────
# Défaut IDF = console primaire sur UART0 (header GPIO43/44), plus une console
# SECONDAIRE sur l'USB-Serial/JTAG — mais celle-ci est en SORTIE SEULE. Or ce
# firmware doit RECEVOIR des commandes (changer de mire, lancer un stimulus,
# rejouer une mesure) sans être reflashé entre chaque observation : un seul
# binaire pour toutes les configurations, sinon on ajoute une variable qu'on ne
# contrôle pas à chaque A/B.
#
# ⚠️ CE QUE ÇA COÛTE, ET C'EST RÉEL : le log ne part plus sur le header UART
#    TX=GPIO43/RX=GPIO44. dn1-1 avait mesuré ce second chemin et le comptait
#    comme voie de secours si le bring-up de l'écran perturbait l'USB. Ici,
#    l'USB devient le chemin UNIQUE.
#    Pour récupérer le header : remplacer cette ligne par
#    `CONFIG_ESP_CONSOLE_UART_DEFAULT=y`, puis `rm sdkconfig && idf.py build`.
#    Ce qu'on récupère : le log repart sur les DEUX chemins (header UART ET USB,
#    via la console secondaire en sortie seule, exactement comme hello-desknode),
#    et la console INTERACTIVE se retrouve sur le header — `dn_console.c` monte
#    un REPL UART par compilation conditionnelle dans cette configuration.
#    Ce qu'on perd : l'USB ne REÇOIT plus les commandes. Il faut un adaptateur
#    USB-série sur TX=GPIO43/RX=GPIO44 (115200) pour taper quoi que ce soit.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ── LVGL (story dn1-3) ───────────────────────────────────────────────────────
# Les symboles CONFIG_LV_… viennent du Kconfig de lvgl/lvgl 9.5.0, tiré par
# main/idf_component.yml. Les trois lignes ci-dessous sont écrites MÊME quand
# elles reprennent le défaut de LVGL : ce sont celles dont un changement casserait
# une propriété MESURÉE du socle, et un défaut amont peut bouger d'une version à
# l'autre sans prévenir.

# C'est DÉJÀ le défaut de LVGL, et on l'écrit quand même : le framebuffer RGB du
# panneau est en RGB565 (dn_display.c : bits_per_pixel = 16) et l'asset Living PCB
# est du RGB565 natif non compressé. Tant que LVGL rend dans le même format, le
# flush est une COPIE ; en 24 ou 32 bits ce serait une CONVERSION par pixel, à
# chaque rafraîchissement partiel. Le budget de la story (§5.4 : 26,7 ms de trame)
# ne le supporterait pas.
CONFIG_LV_COLOR_DEPTH_16=y

# ⚠️ PAS de « swap bytes » : c'est un réglage de bus SPI/I80 (octets envoyés en
# série). Ici les pixels sont lus par la DMA depuis la PSRAM en 16 bits d'un coup,
# dans l'ordre natif little-endian. Le flag `swap_bytes` d'esp_lvgl_port reste
# donc à 0 dans dn_ui.c. Cette ligne n'existe pas : elle est écrite pour qu'on ne
# l'ajoute pas « par symétrie avec les exemples SPI ».

# Défaut LVGL = 14, illisible sur 480x640 à ~50 cm. 28 est la taille du label
# vivant d'AC2 ; elle porte aussi l'observation « textes fins clairs violets »
# héritée de dn1-2, qui demande des jambages FINS et ANTIALIASÉS pour se rejouer.
#
# 🔴 dn3-1 : MONTSERRAT_28 EST DÉSACTIVÉE. `main/fonts/dn_font_28.c` la remplace
#    — même TTF, même bpp, mêmes drapeaux, mais avec le LATIN-1 COMPLET et 10
#    icônes FontAwesome en plus (dont 2 déjà symboles ⇒ 8 codepoints neufs ;
#    disait « 7 », corrigé en revue le 2026-08-18 — les comptes font foi dans
#    `main/fonts/dn_font.h`, qui les calcule). Plus rien dans le firmware ne référence
#    `lv_font_montserrat_28` : la garder aurait coûté ses 37 248 o de données
#    pour un symbole mort.
CONFIG_LV_FONT_MONTSERRAT_28=n

# ⚠️ MONTSERRAT_14, ELLE, RESTE ACTIVE — ET CE N'EST PAS UNE INCOHÉRENCE.
#    Elle est aussi `LV_FONT_DEFAULT` (CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y),
#    et le Kconfig de LVGL 9.5 n'offre AUCUN choix « police personnalisée » pour
#    ce réglage : le `choice LV_FONT_DEFAULT` (Kconfig:991-1040) n'énumère que
#    des built-ins. La désactiver casserait le build, et l'y forcer demanderait
#    de patcher un composant managé — gitignoré et régénéré, donc un correctif
#    qui ne survivrait pas au premier `idf.py reconfigure`.
#    ⇒ On paie ses 13 596 o de données DÉLIBÉRÉMENT, pour un usage unique : la
#      police de repli des labels dont personne n'a fixé la fonte. Tous les
#      textes de dn_ui posent la leur explicitement.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# ⚠️ CONFIG_LV_USE_PERF_MONITOR est DÉLIBÉRÉMENT ABSENT (défaut n, gardé à n).
# Il dessine un encart fps/CPU EN PERMANENCE dans un coin de l'écran : il
# INVALIDERAIT une zone à chaque cycle de rafraîchissement, donc il fabriquerait
# lui-même le trafic de flush qu'AC3 est censé mesurer. L'instrument serait le
# stimulus. La mesure passe par les compteurs de `dn_ui.c` (commande `flush`),
# qui n'affichent rien à l'écran.

# ⚠️ Le tas de LVGL (`lv_malloc`) reste sur l'implémentation intégrée
# (CONFIG_LV_USE_BUILTIN_MALLOC=y, défaut) : 64 Ko RÉSERVÉS EN STATIQUE dans le
# .bss de la RAM interne. Conséquence à ne pas se cacher pour AC8 : ce coût-là est
# INVISIBLE à un avant/après `heap_caps_get_free_size()`, puisqu'il est déjà
# prélevé au link. C'est pour ça que la commande `ui` imprime `lv_mem_monitor()` :
# c'est le seul instrument qui dise ce que LVGL consomme RÉELLEMENT dans ces
# 64 Ko. Ne pas remplacer par LV_USE_CLIB_MALLOC sans re-mesurer les deux.

# ── Confort de diagnostic ────────────────────────────────────────────────────
# Le bring-up RGB panique (accès cache, DMA affamée). Un backtrace symbolisé
# vaut une heure de tâtonnement ; `idf.py monitor` fait la symbolisation via
# l'ELF, encore faut-il que le panic HANDLER s'affiche plutôt que de rebooter.
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

